from cvxopt import matrix, solvers

# c - коэффициенты переменных в целевой функции (себестоимость добычи тонны угля и средние затраты на перевозку угля от
# карьеров до пункта хранения
c = matrix([5.0+19.7, 5.0+12.8, 5.0+22.6, 6.3+27.4, 6.3+19.7, 6.3+29.4, 6.9+30.0, 6.9+6.8, 6.9+4.2, 9.2+31.1, 9.2+9.2,
            9.2+11.1, 6.3+15.9, 6.3+30.2, 6.3+14.3], tc='d')

# G - коэффициенты переменных в ограничениях неравенствах
G = matrix([
           # ограничения по суточной добыче угля на карьерах
           [1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],  # 1
           [0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0],  # 2
           [0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0],  # 3
           [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0],  # 4
           [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1],  # 5

           # ограничения по вместимости пунктов хранения
           [1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0],  # 1
           [0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0],  # 2
           [0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1],  # 3

           # ограничение по суточной добыче угля (80)
           [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],

           # ограничения по качеству угля
           # зольность
           [0.217, 0.217, 0.217, 0.159, 0.159, 0.159, 0.188, 0.188, 0.188, 0.192, 0.192, 0.192, 0.203, 0.203, 0.203],
           # сера
           [0.016, 0.016, 0.016, 0.022, 0.022, 0.022, 0.015, 0.015, 0.015, 0.014, 0.014, 0.014, 0.022, 0.022, 0.022],
           # влага
           [0.083, 0.083, 0.083, 0.067, 0.067, 0.067, 0.084, 0.084, 0.084, 0.086, 0.086, 0.086, 0.083, 0.083, 0.083],
           # летучие вещества
           [0.311, 0.311, 0.311, 0.337, 0.337, 0.337, 0.355, 0.355, 0.355, 0.359, 0.359, 0.359, 0.324, 0.324, 0.324],
           ],
           tc='d'
           )

# h - значения правых частей ограничений-неравенств
h = matrix([16, 21, 18, 14, 19, 14, 30, 56, 80, 0.2, 0.02, 0.08, 0.35], tc='d')

solution = solvers.lp(c, G.T, h, solver='glpk')
print('Status: ', solution['status'])
print('x = \n', solution['x'])
print('Objective: ', solution['primal objective'])
